<!-- Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К». -->


<?php
$regions = [];
$regions['Московская область'] = ['Москва', 'Зеленоград', 'Клин'];
$regions['Ленинградская область'] = ['Санкт-Петербург', 'Павловск', 'Всеволожск', 'Кронштадт'];
$regions['Рязанская область'] = ['Рязань', 'Скопин', 'Михайлов', 'Касимов'];

foreach ($regions as $region => $cities) {
    echo "$region: <br/>";
    for ($i = 0; $i < count($cities); $i++) {
        if(mb_substr($cities[$i],0,1) == "К") {
            echo $cities[$i]." ";
        }
        
        if ($i === count($cities) - 1)
            echo "<br/><br/>";
        
    }
}

?>